; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared3 - mode
	spectrograph0 - mode
	image1 - mode
	infrared2 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 infrared2)
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
)
(:goal (and
	(have_image Planet7 image1)
	(have_image Star8 image1)
	(have_image Planet9 infrared2)
	(have_image Star10 spectrograph0)
	(have_image Phenomenon11 spectrograph0)
	(have_image Star12 infrared3)
	(have_image Planet13 spectrograph0)
	(have_image Star14 spectrograph0)
))

)

; plan
1. (turn_to satellite0 groundstation4 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 planet9 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet9)
   goals met: 0 of 8
5. (take_image satellite0 planet9 instrument0 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 1 of 8
6. (turn_to satellite0 planet7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet7)
   goals met: 1 of 8
7. (take_image satellite0 planet7 instrument0 image1)
   added: (have_image planet7 image1)
   goals met: 2 of 8
8. (turn_to satellite0 planet13 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet13)
   goals met: 2 of 8
9. (take_image satellite0 planet13 instrument0 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 3 of 8
10. (turn_to satellite0 phenomenon11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 8
11. (take_image satellite0 phenomenon11 instrument0 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 4 of 8
12. (turn_to satellite0 star10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 star10)
   goals met: 4 of 8
13. (take_image satellite0 star10 instrument0 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 5 of 8
14. (turn_to satellite0 star12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star12)
   goals met: 5 of 8
15. (take_image satellite0 star12 instrument0 infrared3)
   added: (have_image star12 infrared3)
   goals met: 6 of 8
16. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 6 of 8
17. (take_image satellite0 star14 instrument0 spectrograph0)
   added: (have_image star14 spectrograph0)
   goals met: 7 of 8
18. (turn_to satellite0 star8 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star8)
   goals met: 7 of 8
19. (take_image satellite0 star8 instrument0 image1)
   added: (have_image star8 image1)
   goals met: 8 of 8
